# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# ─── Core CLI ────────────────────────────────────────────
brew "bitwarden-cli"
brew "git"
brew "gnupg"
brew "gh"
brew "curl"
brew "wget"
brew "jq"
brew "yq"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "fzf"
brew "zoxide"
brew "tree"
brew "stow"
brew "starship"
brew "direnv"
brew "just"
brew "neovim"
brew "httpie"
brew "tldr"

# ─── Shell & Plugins ────────────────────────────────────
brew "antidote"
brew "fastfetch"
brew "btop"
brew "procs"

# ─── Dev Tools ───────────────────────────────────────────
brew "mise"
brew "pnpm"
brew "gradle"

# ─── Containers & Cloud ─────────────────────────────────
brew "kubectl"
brew "kubectx"
brew "helm"
brew "k9s"
brew "awscli"
brew "argocd"
brew "colima"
brew "docker"
brew "docker-compose"
brew "kustomize"
brew "opentofu"

# ─── Database ────────────────────────────────────────────
brew "pgcli"


# ─── IDEs & Editors ─────────────────────────────────────
cask "intellij-idea"
cask "visual-studio-code"
cask "zed"

# ─── Terminal ───────────────────────────────────────────
cask "ghostty"

# ─── Browsers ───────────────────────────────────────────
cask "firefox"
cask "google-chrome"

# ─── Communication ──────────────────────────────────────
cask "signal"
cask "slack"
cask "telegram"

# ─── Productivity ───────────────────────────────────────
cask "raycast"
cask "rectangle"
cask "bitwarden"

# ─── Knowledge & Notes ──────────────────────────────────
cask "anytype"
# cask "obsidian"

# ─── DevOps ─────────────────────────────────────────────
cask "openlens"

# ─── AI ─────────────────────────────────────────────────
cask "claude"
cask "claude-code"
cask "codex"
cask "lmstudio"

# ─── Media ──────────────────────────────────────────────
cask "spotify"

# ─── Fonts ──────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"

# ─── Mac App Store (examples, uncomment as needed) ──────
# mas "Xcode", id: 497799835
# mas "Amphetamine", id: 937984704
# mas "Magnet", id: 441258766
