# Taps
tap "homebrew/bundle"

# ─── Bootstrap (required for dotfiles setup) ───────────
brew "bitwarden-cli"  # Bitwarden password manager CLI
brew "git"            # Distributed version control
brew "gnupg"          # GPG encryption and signing
brew "just"           # Command runner (like make)
brew "mise"           # Polyglot runtime manager
brew "stow"           # Symlink farm manager for dotfiles

# ─── Core CLI ────────────────────────────────────────────
brew "bat"            # cat with syntax highlighting
brew "curl"           # URL data transfer tool
brew "direnv"         # Per-directory environment variables
brew "eza"            # Modern ls replacement
brew "fd"             # Fast file finder
brew "fzf"            # Fuzzy finder
brew "gh"             # GitHub CLI
brew "httpie"         # User-friendly HTTP client
brew "jq"             # JSON processor
brew "neovim"         # Vim-based text editor
brew "ripgrep"        # Fast recursive search (rg)
brew "shellcheck"     # Shell script linter
brew "starship"       # Cross-shell prompt
brew "tldr"           # Simplified man pages
brew "tree"           # Directory tree viewer
brew "wget"           # File downloader
brew "yq"             # YAML processor
brew "zoxide"         # Smarter cd command

# ─── Shell & Plugins ────────────────────────────────────
brew "antidote"       # Zsh plugin manager
brew "btop"           # Interactive process viewer
brew "fastfetch"      # System info display
brew "fish"           # Friendly interactive shell
brew "procs"          # Modern ps replacement
brew "taproom"        # Interactive TUI for Homebrew

# ─── Dev Tools ───────────────────────────────────────────
brew "bun"            # Fast JavaScript runtime and toolkit
brew "gradle"         # JVM build tool
brew "lazygit"        # Terminal UI for git
brew "pnpm"           # Fast Node.js package manager

# ─── Containers & Cloud ─────────────────────────────────
brew "argocd"         # GitOps continuous delivery CLI
brew "awscli"         # AWS CLI
brew "colima"         # Container runtime for macOS
brew "docker"         # Container engine
brew "docker-compose" # Multi-container orchestration
brew "helm"           # Kubernetes package manager
brew "k9s"            # Kubernetes TUI
brew "kubectl"        # Kubernetes CLI
brew "kubectx"        # Switch k8s contexts/namespaces
brew "kustomize"      # Kubernetes manifest customization
brew "opentofu"       # Infrastructure as code (Terraform fork)

# ─── Database ────────────────────────────────────────────
brew "pgcli"          # PostgreSQL CLI with autocompletion

# ─── IDEs & Editors ─────────────────────────────────────
cask "intellij-idea"       # JetBrains Java/Kotlin IDE
cask "visual-studio-code"  # Microsoft code editor
cask "zed"                 # Fast collaborative editor

# ─── Terminal ───────────────────────────────────────────
cask "ghostty"        # GPU-accelerated terminal

# ─── Browsers ───────────────────────────────────────────
cask "firefox"        # Mozilla web browser
cask "google-chrome"  # Google web browser

# ─── Communication ──────────────────────────────────────
cask "signal"         # Encrypted messaging
cask "slack"          # Team communication
cask "telegram"       # Cloud-based messaging

# ─── Productivity ───────────────────────────────────────
# cask "aerospace"    # Tiling window manager
cask "bitwarden"      # Password manager
cask "raycast"        # Launcher and productivity tool
cask "rectangle"      # Window management via keyboard

# ─── Knowledge & Notes ──────────────────────────────────
cask "anytype"        # Local-first knowledge base
cask "obsidian"     # Markdown knowledge base

# ─── DevOps ─────────────────────────────────────────────
cask "openlens"       # Kubernetes IDE

# ─── AI ─────────────────────────────────────────────────
cask "claude"         # Anthropic AI assistant
cask "claude-code"    # AI coding agent CLI
cask "codex"          # OpenAI coding agent CLI
brew "llmfit"         # Find what LLM models run on your hardware
cask "lmstudio"       # Local LLM runner
brew "opencode"       # AI coding agent TUI

# ─── Media ──────────────────────────────────────────────
cask "spotify"        # Music streaming

# ─── Fonts ──────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"  # Dev font with icons

# ─── Mac App Store (examples, uncomment as needed) ──────
# mas "Xcode", id: 497799835
# mas "Amphetamine", id: 937984704
# mas "Magnet", id: 441258766
