# ─── Bootstrap (required for dotfiles setup) ───────────
brew "bitwarden-cli"  # Bitwarden password manager CLI
brew "git"            # Distributed version control
brew "git-lfs"        # Git extension for large files
brew "gnupg"          # GPG encryption and signing
brew "just"           # Command runner (like make)
brew "mise"           # Polyglot runtime manager
brew "stow"           # Symlink farm manager for dotfiles

# ─── Core CLI ────────────────────────────────────────────
brew "bat"            # cat with syntax highlighting
brew "curl"           # URL data transfer tool
brew "difftastic"     # Structural diff that understands syntax
brew "direnv"         # Per-directory environment variables
brew "duf"            # Disk free overview (better df)
brew "dust"           # Visual disk usage (better du)
brew "entr"           # Run commands when files change
brew "eza"            # Modern ls replacement
brew "fd"             # Fast file finder
brew "fzf"            # Fuzzy finder
brew "gh"             # GitHub CLI
brew "glow"           # Render markdown in the terminal
brew "httpie"         # User-friendly HTTP client
brew "hyperfine"      # CLI benchmarking tool
brew "jq"             # JSON processor
brew "neovim"         # Vim-based text editor
brew "ripgrep"        # Fast recursive search (rg)
brew "sd"             # Simple sed replacement
brew "shellcheck"     # Shell script linter
brew "starship"       # Cross-shell prompt
brew "tldr"           # Simplified man pages
brew "trash"          # Safe rm — moves to trash
brew "tree"           # Directory tree viewer
brew "wget"           # File downloader
brew "yq"             # YAML processor
brew "zoxide"         # Smarter cd command

# ─── Shell & Plugins ────────────────────────────────────
brew "antidote"       # Zsh plugin manager
brew "btop"           # Interactive process viewer
brew "fastfetch"      # System info display
brew "fish"           # Friendly interactive shell
brew "procs"          # Modern ps replacement
brew "taproom"        # Interactive TUI for Homebrew

# ─── Dev Tools ───────────────────────────────────────────
brew "bun"            # Fast JavaScript runtime and toolkit
brew "delta"          # Better git diffs with syntax highlighting
brew "gradle"         # JVM build tool
brew "lazygit"        # Terminal UI for git
brew "pnpm"           # Fast Node.js package manager
brew "tig"            # Text interface for git repositories

# ─── Containers & Cloud ─────────────────────────────────
brew "argocd"         # GitOps continuous delivery CLI
brew "awscli"         # AWS CLI
brew "colima"         # Container runtime for macOS
brew "docker"         # Container engine
brew "docker-compose" # Multi-container orchestration
brew "helm"           # Kubernetes package manager
brew "k9s"            # Kubernetes TUI
brew "kubernetes-cli"  # Kubernetes CLI (kubectl)
brew "kubectx"        # Switch k8s contexts/namespaces
brew "kustomize"      # Kubernetes manifest customization
brew "opentofu"       # Infrastructure as code (Terraform fork)

# ─── Network ───────────────────────────────────────────
brew "nmap"           # Network scanning and discovery tool

# ─── Database ────────────────────────────────────────────
brew "pgcli"          # PostgreSQL CLI with autocompletion

# ─── IDEs & Editors (primary: IntelliJ IDEA) ──────────
cask "intellij-idea"       # JetBrains Java/Kotlin IDE
# cask "intellij-idea-ce"    # JetBrains Community Edition (free)
cask "visual-studio-code"  # Microsoft code editor
cask "zed"                 # Fast collaborative editor

# ─── Terminal (primary: Ghostty) ──────────────────────
cask "ghostty"        # GPU-accelerated terminal
# cask "alacritty"      # OpenGL terminal emulator
# cask "iterm2"         # Feature-rich terminal for macOS
# cask "kitty"          # GPU-based terminal emulator
# cask "warp"           # AI-powered modern terminal
# cask "wezterm"        # GPU-accelerated cross-platform terminal

# ─── Browsers (primary: Chromium) ─────────────────────
cask "chromium"       # Open-source web browser
cask "arc"            # Modern Chromium browser with workspaces
cask "brave-browser"  # Privacy-focused Chromium browser
cask "firefox"        # Mozilla web browser
cask "google-chrome"  # Google web browser
cask "microsoft-edge" # Chromium-based browser with AI integrations
cask "orion"          # Lightweight WebKit browser by Kagi
cask "vivaldi"        # Highly customizable Chromium browser

# ─── Communication ──────────────────────────────────────
cask "signal"         # Encrypted messaging
cask "slack"          # Team communication
cask "telegram"       # Cloud-based messaging

# ─── Productivity ───────────────────────────────────────
# cask "aerospace"    # Tiling window manager
cask "bitwarden"      # Password manager
cask "displaylink"    # External monitor driver for DisplayLink docks
cask "raycast"        # Launcher and productivity tool
cask "rectangle"      # Window management via keyboard

# ─── Knowledge & Notes ──────────────────────────────────
cask "anytype"        # Local-first knowledge base
cask "archi"          # ArchiMate modelling tool
cask "obsidian"       # Markdown knowledge base

# ─── DevOps ─────────────────────────────────────────────
cask "openlens"       # Kubernetes IDE

# ─── AI ─────────────────────────────────────────────────
cask "claude"         # Anthropic AI assistant
cask "claude-code"    # AI coding agent CLI
cask "codex"          # OpenAI coding agent CLI
brew "llmfit"         # Find what LLM models run on your hardware
cask "lmstudio"       # Local LLM runner
brew "opencode"       # AI coding agent TUI

# ─── Media ──────────────────────────────────────────────
cask "spotify"        # Music streaming
cask "vlc"            # Universal media player

# ─── Fonts ──────────────────────────────────────────────
cask "font-fira-code-nerd-font"       # Ligature-rich dev font
cask "font-hack-nerd-font"            # Clean, readable dev font
cask "font-jetbrains-mono-nerd-font"  # Dev font with icons
cask "font-meslo-lg-nerd-font"        # Customized Menlo font
cask "font-monaspace-nerd-font"       # GitHub's texture healing font

# ─── Mac App Store (examples, uncomment as needed) ──────
# mas "Xcode", id: 497799835
# mas "Amphetamine", id: 937984704
# mas "Magnet", id: 441258766
